---
kind: property
id: P:Autodesk.Revit.DB.ColorFillSchemeEntry.Color
zh: 着色、上色、染色、填色
source: html/51bf35c9-3ae3-7fef-2bfb-0b9007742126.htm
---
# Autodesk.Revit.DB.ColorFillSchemeEntry.Color Property

**中文**: 着色、上色、染色、填色

The filling color of this entry.

## Syntax (C#)
```csharp
public Color Color { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null